@extends('layouts.front.home')

@section('content')
    <section>
        <div class="container">
            <div class="row">
                <div class="col-lg-12 p-5 text-center">
                    <div class="section-title">
                        <h3>متطلبات النظام</h3>
                        <span class="section-title-bg"></span>
                    </div>
                </div>


                <div class="row m-5 ">
                    <div class="col-lg-9">
                        <h4>متطلبات أجهزة الحاسب</h4>
                        <br>

                        <ul>
                            <li>جهاز حاسب يمتلك معالج ثنائي النواة مع ذاكرة عشوائية RAM لا تقل عن 2G.</li>
                            <li>ينصح باستخدام نظام تشغيل قادر على تشغيل الإصدارات الأخيرة من متصفح كروم Chrome أو فيرفوكس Firefox.</li>
                        </ul>
                        <p>بالنسبة للمتصفح فمتصفحي كروم وفيرفوكس هما الأكفى والأكثر دعما لقنيات التواصل الصوتي في الوقت الحقيقي webRTC. باقي المتصفحات مثل سفاري و انترنت اكسبلورر ليست بنفس الكفاءة ولكنها مدعومة بشكل عام.</p>
                        <br>

                        <h4>أجهزة الموبايل المدعومة</h4>
                        <p>يدعم نظام ايسنك أنظمة أندرويد حيث يعمل النظام من خلال المتصفح بشكل مباشر ودون تنصيب أية تطبيقات أو أضافات. يتطلب النظام نظام أندرويد الإصدار السادس وأعلى.</p>
                        <p>جميع مميزات آيسنك نعمل على نظام أندرويد ماعدا مشاركة الشاشة حيث لا يدعم متصفح كروم هذه الميزة على نظام آندرويد.</p>
                        <p>يعمل نظام ايسنك على أجهزة الآيفون وذلك من خلال متصفح سفاري ولا يتطلب النظام تنصيب أية تطبيقات أو إضافات. يتطلب نظام ايسنك نظام تشغيل iOS 12.2 وما يليه.</p>
                        <p>معظم مميزات النظام تعمل على نظام آي أو إس وأجهزة الأيفون فيما عدا مشاركة الشاشة، حيث لا يدعم متصفح سفاري مشاركة الشاشة بعد.</p>

                        <hr>

                        <h4>متطلبات سرعة الانترنت</h4>
                        <p>متطلبات الضيوف (المستمع)</p>
                        <p>ينصح باستخدام خط انترنت لا تقل سرعته عن 0.5Mbits/sec للرفع وسرعة لا تقل عن 1Mbits في التحميل.</p>
                        <p>هذه الأرقام وسطية وتختلف بناء على وقت البث وهل يتم استخدام خط الانترنت في تطبيقات أو برامج أخرى.</p>
                        <p>لاختبار سرعة الانترنت يمكن استخدام<a href="https://www.speedtest.net">https://www.speedtest.net</a> </p>
                        <p>متطلبات صاحب القاعة (المحاضر)</p>
                        <p>يفضل استخدام أفضل سرعة ممكنة. خاصة عند مشاركة الكاميرا وشاشة سطح المكتب، والتي تتطلب سرعة مضاعفة للانترنت لدى المحاضر.</p>
                    </div>
                </div>

            </div>
        </div>
    </section>
@endsection


@section('script')
    <script>
        $('#smooths').addClass('active');
    </script>
@endsection

